""" Програма використовує flask та запускає веб-сервер.
При запиті на цей сервер він повертає вміст файлу index.html
У цій версії передбачається, що файл може бути шаблон. """
from flask import Flask, render_template
import os

#список учасників конкурсу 
p_list = [('Віктор','Київ'), ('Володимир','Київ'), ('Юлія','Одеса'), ('Микола','Луцьк'),('Іван','Київ'),('Петро','Рівне')]

def index():
    """ функція обробляє шаблон index.html і повертає документ, що вийшов."""
    return render_template('index.html', p_list = p_list , city= "Київ")

folder = os.getcwd() # запам'ятали поточну робочу папку
# Створюємо об'єкт веб-програми:
app = Flask(__name__, template_folder=folder, static_folder=folder) # перший параметр - ім'я модуля
                            # параметр з ім'ям static_folder визначає ім'я папки, що містить статичні файли
                            # параметр з ім'ям template_folder визначає ім'я папки, що містить шаблони

# створюємо правило для URL '/': 
app.add_url_rule('/', 'index', index)

if __name__ == "__main__":
    # Запускаємо веб-сервер:
    app.run()
